Revit 2027 API
StructuralSectionShape Enumeration
 Shapes for structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralSectionShape
Public Enumeration StructuralSectionShape
public enum class StructuralSectionShape
type StructuralSectionShape
Members
Member name | Value | Description
ConcreteCross | 34 |  Defines parameters for Concrete Cross structural sections.
ConcreteI | 36 |  Defines parameters for Concrete I structural sections.
ConcreteL | 37 |  Defines parameters for Concrete L structural sections.
ConcretePolygon | 38 |  Defines parameters for Concrete Polygon structural sections.
ConcreteRectangle | 31 |  Defines parameters for Concrete Rectangle structural sections.
ConcreteRectangleCut | 32 |  Defines parameters for Concrete Rectangle Cut structural sections.
ConcreteRound | 35 |  Defines parameters for ConcreteRound structural sections.
ConcreteT | 33 |  Defines parameters for Concrete T structural sections.
CParallelFlange | 9 |  Defines parameters for C-channel Parallel Flange structural sections.
CProfile | 20 |  Defines parameters for structural C Profile sections.
CProfileWithFold | 22 |  Defines parameters for structural C Profile sections with fold.
CProfileWithLips | 21 |  Defines parameters for structural C Profile sections with lips .
CSlopedFlange | 10 |  Defines parameters for C-channel Sloped Flange structural sections.
Invalid | -1 |  This element do not support structural section.
IParallelFlange | 6 |  Defines parameters for I-shape Parallel Flange structural sections.
ISlopedFlange | 7 |  Defines parameters for I-shape Sloped Flange structural sections.
ISplitParallelFlange | 17 |  Defines parameters for I-split Parallel Flange structural sections.
ISplitSlopedFlange | 18 |  Defines parameters for I-split Sloped Flange structural sections.
IWelded | 16 |  Defines parameters for I-shape Welded structural sections.
IWideFlange | 8 |  Defines parameters for I-shape Wide Flange structural sections.
LAngle | 11 |  Defines parameters for L-angle structural sections.
LProfile | 23 |  Defines parameters for structural L Profile structural sections.
LProfileWithLips | 24 |  Defines parameters for structural L Profile sections with lips.
NotDefined | 0 |  Structural section was not defined for this element
PipeStandard | 5 |  Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
RectangleHSS | 14 |  Defines parameters for Rectangular HSS structural sections.
RectangleParameterized | 2 |  Defines parameters for parameterized rectangle structural sections.
RectangularBar | 12 |  Defines parameters for Rectangular Bar structural sections.
RoundBar | 13 |  Defines parameters for Round Bar structural sections.
RoundHSS | 15 |  Defines parameters for Round HSS structural sections.
SigmaProfile | 27 |  Defines parameters for Sigma Profile structural sections.
SigmaProfileWithFold | 29 |  Defines parameters for structural Sigma sections profile with fold.
SigmaProfileWithLips | 28 |  Defines parameters for structural Sigma sections profile with lips.
StructuralTees | 19 |  Defines parameters for Structural Tees structural sections.
UserDefined | 30 |  Defines parameters for user defines structural sections.
ZProfile | 25 |  Defines parameters for structural Z Profile structural sections.
ZProfileWithLips | 26 |  Defines parameters for structural L profile sections with lips.
Remarks
 Allow safely differentiate between classes inherited from Autodesk::Revit::DB::Structure::StructuralSections::StructuralSection class.
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace